[
    {
        "id": 1,
        "category": "computer_science",
        "title": "Python for Everybody",
        "description": "Learn to Program and Analyze Data with Python. Develop programs to gather, clean, analyze, and visualize data.",
        "image": "./img/python-course.png",
        "instructor": "Charles Russell Severance",
        "enrolledNum": "12,826",
        "length": 5,
        "lengthDescription": "Get in-depth knowledge of a subject.",
        "rating": 4.8,
        "feedbackNum": "2,691",
        "level": "Beginner",
        "like": 89,
        "learningOutcome": [
            "Install Python and write your first program,",
            "Describe the basics of the Python programming language,",
            "Use variables to store, retrieve and calculate information.",
            "Utilize core programming tools such as functions and loops."
        ],
        "skillOutcome": [
            "Python Programming",
            "Computer Programming",
            "Computational Thinking",
            "Scripting",
            "Scripting Languages",
            "Programming Principles",
            "Development Environment"
        ]
    },
    {
        "id": 2,
        "category": "business",
        "title": "Foundations of Project Management",
        "description": "Upgrade yourself with these fundamental skills to manage projects.",
        "image": "./img/project-managing-course.png",
        "instructor": "Christine Morrison",
        "enrolledNum": "20,387",
        "length": 4,
        "lengthDescription": "Gain insight into a topic and learn the fundamentals.",
        "rating": 4.9,
        "feedbackNum": "6,956",
        "level": "Beginner",
        "like": 99,
        "learningOutcome": [
            "Describe project management skills, roles, and responsibilities across a variety of industries.",
            "Define organizational structure and organizational culture and explain how it impacts project management.",
            "Explain the project management life cycle and compare different program management methodologies."
        ],
        "skillOutcome": [
            "Organizational Structure",
            "Organizational Change",
            "Project Planning",
            "Project Closure",
            "Project Management",
            "Program Management",
            "Waterfall Methodology",
            "Project Management Life Cycle"
        ]
    },
    {
        "id": 3,
        "category": "health",
        "title": "Vital Signs: Understanding What the Body Is Telling Us",
        "description": "Explore the anatomy and physiology underlying the vital signs so that you will develop a systematic, integrated understanding of how the body functions.",
        "image": "./img/health-course.png",
        "instructor": "Connie Scanga",
        "enrolledNum": "32,102",
        "length": 6,
        "lengthDescription": "Gain insight into a topic and learn the fundamentals.",
        "rating": 4.8,
        "feedbackNum": "6,851",
        "level": "Beginner",
        "like": 97,
        "learningOutcome": [
            "In this six-part course we explore the anatomy and physiology underlying the vital signs so that you will develop a systematic, integrated understanding of how the body functions. Relevant body systems are reviewed including cardiovascular and respiratory, followed by explanations of how the function of these systems affects vital signs. We discuss normal ranges, normal variants, and the mechanisms that underlie changes in the objective measurement of vital signs. The course also includes demonstrations of appropriate techniques for measuring vital signs in yourself and others.",
            "The course is designed for a broad, general audience but will be particularly interesting for individuals working in healthcare, those considering a career as a healthcare professional, lay caregivers, those with an interest in personal health and fitness, or anyone who simply wants to understand how the body functions."
        ],
        "skillOutcome": [
            "Patient Evaluation",
            "Neurology",
            "Health Assessment",
            "Vital Signs",
            "Pulmonology",
            "Systems Of Measurement",
            "Anatomy",
            "Respiration",
            "Biology",
            "Cardiology"
        ]
    },
    {
        "id": 4,
        "category": "health",
        "title": "Introductory Human Physiology",
        "description": "Discover the fascinating world of human physiology and learn about the body's organ systems, their functions, and how they maintain health.",
        "image": "./img/physiology-course.png",
        "instructor": "Jennifer Carbrey; Emma Jakoi",
        "enrolledNum": "9,851",
        "length": 10,
        "lengthDescription": "Gain insight into a topic and learn the fundamentals.",
        "rating": 4.8,
        "feedbackNum": "5,268",
        "level": "Beginner",
        "like": 97,
        "learningOutcome": [
            "Master key concepts in human physiology and homeostasis",
            "Delve into the nervous, endocrine, cardiovascular, respiratory, and urinary systems",
            "Examine the role of senses, muscles, gastrointestinal, and reproductive systems",
            "Apply knowledge to real-life situations and medical conditions",
            "(Bonus) Enhance your learning with a unique immersive virtual reality (VR) experience that takes you on an incredible journey inside the human body."
        ],
        "skillOutcome": [
            "Anatomy",
            "Nutrition and Diet",
            "Vital Signs",
            "Neurology",
            "Kinesiology",
            "Cardiology",
            "Biology",
            "Nephrology",
            "Respiration",
            "Pulmonology",
            "Biochemistry",
            "Urology",
            "Gynecology"
        ]
    },
    {
        "id": 5,
        "category": "health",
        "title": "Introduction to Social Psychology",
        "description": "Learn the classic and contemporary social psychology , covering topics such as decision making, persuasion, and factors that promote health and well-being.",
        "image": "./img/psychology-coursse.png",
        "instructor": "Scott Plous",
        "enrolledNum": "9,815",
        "length": 7,
        "lengthDescription": "Gain insight into a topic and learn the fundamentals.",
        "rating": 4.7,
        "feedbackNum": "5,068",
        "level": "Beginner",
        "like": 96,
        "learningOutcome": [
            "Explain key theories and concepts in social psychology and how they influence human behavior.",
            "Analyze how social factors such as culture, group dynamics, and social norms shape decision making.",
            "Identify the causes of prejudice, conflict, and persuasion and evaluate strategies to reduce bias and promote cooperation.",
            "Apply social psychology research methods to real-world problems involving health, environment, and well-being."
        ],
        "skillOutcome": [
            "Social Psychology",
            "Behavior Analysis",
            "Research Methods",
            "Critical Thinking",
            "Conflict Resolution",
            "Persuasive Communication",
            "Ethical Reasoning",
            "Cultural Awareness",
            "Interpersonal Communication",
            "Decision Making",
            "Group Dynamics",
            "Experimental Analysis"
        ]
    },
    {
        "id": 6,
        "category": "computer_science",
        "title": "Machine Learning",
        "description": "Build Intelligent Applications. Master machine learning fundamentals in four hands-on courses.",
        "image": "./img/machine-learning-course.png",
        "instructor": "Emily Fox; Carlos Guestrin",
        "enrolledNum": "18,288",
        "length": 4,
        "lengthDescription": "Get in-depth knowledge of a subject.",
        "rating": 4.7,
        "feedbackNum": "12,642",
        "level": "Intermediate",
        "like": 78,
        "learningOutcome": [
            "Explain core machine learning concepts including supervised and unsupervised learning techniques.",
            "Apply prediction, classification, clustering, and information retrieval algorithms to real-world datasets.",
            "Analyze large and complex datasets to extract meaningful patterns and insights.",
            "Design machine learning systems that improve performance over time through iterative training.",
            "Build intelligent applications capable of making data-driven predictions and decisions.",
            "Implement machine learning workflows using Python and industry-standard libraries."
        ],
        "skillOutcome": [
            "Machine Learning",
            "Applied Machine Learning",
            "Supervised Learning",
            "Unsupervised Learning",
            "Statistical Modeling",
            "Predictive Analytics",
            "Predictive Modeling",
            "Data Mining",
            "Deep Learning",
            "Artificial Intelligence (AI/ML)",
            "Image Analysis",
            "Python Programming"
        ]
    },
    {
        "id": 7,
        "category": "physical_science",
        "title": "Astronomy: Exploring Time and Space",
        "description": "Learn more about modern astronomy and get up to date on the most recent astronomical discoveries without prior knowledge in science.",
        "image": "./img/astronomy-course.png",
        "instructor": "Chris Impey",
        "enrolledNum": "6,350",
        "length": 11,
        "lengthDescription": "Gain insight into a topic and learn the fundamentals.",
        "rating": 4.8,
        "feedbackNum": "3,906",
        "level": "Beginner",
        "like": 98,
        "learningOutcome": [
            "Describe fundamental concepts in modern astronomy, including celestial objects and cosmic phenomena.",
            "Explain recent astronomical discoveries and their significance to our understanding of the universe.",
            "Apply basic scientific methods to observe, analyze, and interpret astronomical data.",
            "Use simulations and visualizations to explore astronomical systems and processes.",
            "Recognize the historical development of astronomy from ancient civilizations to modern science.",
            "Develop foundational knowledge in physics and chemistry as they relate to astronomical observations."
        ],
        "skillOutcome": [
            "Astronomy",
            "Physical Science",
            "Scientific Methods",
            "Research",
            "Simulations",
            "Scientific Visualization",
            "Physics",
            "Chemistry",
            "General Science",
            "Engineering and Scientific Instruments",
            "Ancient History"
        ]
    },
    {
        "id": 8,
        "category": "business",
        "title": "Financial Markets",
        "description": "Introduction to risk management and behavioral finance principles to understand the real-world functioning of securities, insurance, and banking industries.",
        "image": "./img/financial-market-course.png",
        "instructor": "Robert Shiller",
        "enrolledNum": "21,988",
        "length": 7,
        "lengthDescription": "Gain insight into a topic and learn the fundamentals.",
        "rating": 4.8,
        "feedbackNum": "11,321",
        "level": "Beginner",
        "like": 97,
        "learningOutcome": [
            "Explain the core ideas, methods, and institutions that enable societies to manage financial risk and promote economic growth.",
            "Analyze how risk management principles are applied across securities, insurance, and banking industries.",
            "Apply concepts from behavioral finance to understand real-world financial decision making and market behavior.",
            "Evaluate the role of financial institutions in fostering enterprise and supporting a well-functioning society.",
            "Assess current financial practices and policies and analyze their implications for future economic stability.",
            "Develop financially savvy leadership skills to manage business and enterprise-level risk effectively."
        ],
        "skillOutcome": [
            "Market Dynamics",
            "Investment Banking",
            "Business Risk Management",
            "Enterprise Risk Management (ERM)",
            "Investments",
            "Behavioral Economics",
            "Securities (Finance)",
            "Banking",
            "Underwriting",
            "Capital Markets",
            "Financial Regulation",
            "Financial Policy",
            "Insurance",
            "Corporate Finance",
            "Governance"
        ]
    }
]